# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, -10]
s = 0
for item in my_list:
    s += item

print(i)

